# В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке, 
# причём кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних. 
# Всего на грядке растёт N кустов.Эти кусты обладают разной урожайностью, 
# поэтому ко времени сбора на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, 
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, 
# которое может собрать за один заход собирающий модуль, 
# находясь перед некоторым кустом заданной во входном файле грядки.

from random import randint

n = 2
while n < 3:
    n = int(input("Введите число кустов на грядке(n > 2): "))

garden = []
for i in range(n):
    garden.append(randint(0,10))
print(garden)

maxSum = 0
for i in range(len(garden)):
    sum = garden[i] + garden[i - 1] + garden[i - 2]
    if sum > maxSum:
        maxSum = sum
print(f"Максимальное число ягод: {maxSum}.")
